[
  ["The ultimate source of power and authority which set the state apart from other forms of political organizations is referred to as", "constitutionalism.", "checks and balances.", "rule of law.", "sovereignty.", "D"],
  ["The institution through which leaders exercise power to make and enforce laws is the", "government.", "judiciary.", "political party.", "security agency.", "A"],
  ["The fundamental principles by which a state is ordered and governed is usually outlined in a", "bill.", "constitution.", "parliamentary proceedings.", "state manual.", "B"],
  ["Which one among the following factors greatly restrains the government in a democratic society?", "Consent of the governed", "Consent of the civil society organizations", "Ideology of the party", "Parliamentary debates", "A"],
  ["The following factors are challenges faced by the judiciary under the doctrine of Separation of Powers except", "appointment of judges.", "financial autonomy.", "removal of judges from office.", "poor legal infrastructure.", "D"],
  ["Accountability in constitutional democracy is best enforced through a system of", "checks and balances.", "civil society organizations", "subversion of the law.", "selection of the right leaders.", "A"],
  ["The application of the common principles that are important to improve decision-making processes and ultimately strengthen democracy and improve social and economic development is best described as", "fundamental right.", "good governance.", "separation of powers.", "social democracy.", "B"],
  ["One of the reasons for having two legislative chambers in the governance structure of a country is to ensure the", "executive is kept under check and control.", "powers of the lower chamber is suppressed.", "strict control of the affairs of the state.", "thorough scrutiny of legislation.", "D"],
  ["Which one of the following factors have contributed largely to the weakened and poor performance of state institutions in many West African States?", "Corruption", "Globalization", "Low remuneration and wages", "Weak institutional memory", "A"],
  ["One of the paramount roles to play as a citizen in sustaining the democratic system of governance is to", "avoid criticism of government.", "play the partisan card.", "pray for a good leader.", "register and vote in elections.", "D"],
  ["The responsibility of citizens towards nation-building is to", "encourage civil disobedience in the face of hardship.", "participate and contribute to decision-making.", "stampede government policies and programmes.", "boycott and withdraw services to the state.", "B"],
  ["By competing in general elections, political parties ultimately offer citizens", "a choice in governance.", "automatic membership of a party.", "opportunity to be extremely loyal to one party.", "opportunity to vilify government.", "A"],
  ["Public opinion is an essential element in a democracy because it can act as a", "check on leadership and government activities.", "mouthpiece for the opposition only.", "news outlet for the media and government only.", "propaganda tool for the government at all material times.", "A"],
  ["The media serve a useful purpose in a democracy by", "connecting the government and the people.", "ensuring government plays to their dictates.", "assisting in the formation of political parties.", "manipulating political leaders in government.", "A"],
  ["One of the pivotal roles played by pressure groups in a functioning democracy is the", "implementation of public policy by them.", "influence on public policy decisions.", "trumpeting of good deeds of a government always.", "blackmailing of the government to act in their favour.", "B"],
  ["Promoting electoral integrity is the crucial function of which institution of state? The", "civil society organizations.", "executive arm of government.", "electoral management body.", "security services.", "C"],
  ["Those rights which are explicitly protected by the constitution are referred to as", "checks and balances.", "constitutional clauses.", "entrenched clauses.", "separation of powers.", "C"],
  ["Constitutionally, the local government administration is controlled by the state through", "administrators.", "legislation.", "native laws.", "state bureau.", "B"],
  ["Which state institution is referred to as the bureaucratic wing responsible for the running of government offices, agencies and departments?", "Bureau of national affairs", "Civil Service", "Controller of state services", "Public services board", "B"],
  ["The local government administration in many West African countries is faced with a myriad of problems one of which is", "employee retention.", "illiterate traditional authorities.", "unavailability of land.", "weak institutional laws.", "D"],
  ["One of the following options does not pass as a means of ensuring the independence of the judiciary which is", "immunity from prosecution.", "promotion on merit.", "security of tenure.", "salary determined by the executive.", "D"],
  ["As part of its constitutional mandate, the Public Service Commission operates to", "appoint the head of the commission.", "carry out the order of the presidency only.", "recruit high ranking personnel for the civil service.", "review salaries and allowances of staff of the executive only.", "C"],
  ["The impartiality of the civil servant is important to the governance structure because they work for the interest of the", "bureaucrat.", "executive.", "presidency.", "state.", "D"],
  ["Which one of the following cannot be considered as a factor that influences the delimitation of a country into constituencies?", "Administrative convenience", "Geographical proximity", "Historical experience", "Political socialization", "D"],
  ["A type of constitution suitable for the governance of federal state is a", "flexible constitution.", "rigid constitution.", "republican constitution.", "parliamentary constitution.", "B"],
  ["A set of principles enshrined in a constitution that guide the government in making laws and policies for the welfare of the people is referred to as", "directive principles of state policy.", "constitutional provisions.", "Human Rights and Administrative Justice.", "edicts, customs and traditions.", "A"],
  ["Which situation in a democratic state can create an environment where military intervention is perceived as the only option to restore order, protect the population or address grievances?", "Boycott of elections", "Economic crises", "Political crises", "Youth unemployment", "C"],
  ["Despite the many challenges bedeviling the Economic Community of West African States (ECOWAS), it has managed over the years in promoting", "regime protection and economic stability in member countries.", "trade tariffs and self-reliance.", "regional integration and cooperation.", "collective will against globalization.", "C"],
  ["One of the reasons for which the United Nations (UN) is considered as the only influential world body is the fact that, it", "plays a crucial role in international diplomacy.", "supports the war mission of member countries.", "influences regime change by supporting the opposition.", "withholds humanitarian support to military regimes.", "A"],
  ["The African Union (AU) aims at ensuring the following developments in member countries except for", "equal distribution of wealth.", "governance and democracy.", "peace and security.", "social development.", "A"],
  ["The Commonwealth of Nations concerns itself with one of the following activities in member countries which is", "assisting in the overthrow of unpopular government.", "conducting elections in member countries.", "operating the financial sector of poor countries.", "promotion of peace and security.", "D"],
  ["The African Union (AU) aims to promote gender equality and women's empowerment through the strategic framework organ of the", "African Peer Review Mechanism (APRM).", "African Development Bank (ADB).", "New Partnership for Africa's Development (NEPAD).", "Specialized Commission of Women Empowerment (SCWE).", "C"],
  ["What encompasses a range of diplomatic, political, economic and security decisions and actions that a state embarks on to protect and promote sovereignty on the global stage?", "Alliances", "Foreign policy", "National interest", "Constitutionalism", "B"],
  ["Which colonial policy worked against the sovereign power and authority of the traditional political authority and institutions?", "Crown Colony Edict", "Expatriate Edict", "Indirect Rule", "Protectorate Colony Law", "C"],
  ["The surge in nationalism and its related activities was fueled by oppressive colonial experience and", "partition of West African territories.", "the strong desire for civilization.", "ideology and activities of pan-Africanism.", "monopoly of mineral resources and land degradation.", "C"],
  ["Which institution of state enables different groups and interests to be represented as well as actively participate in the political space?", "Advocate Groups", "Democracy", "Judiciary", "Political party", "D"],
  ["Nationalism played a crucial role in the struggle for independence in West Africa by way of fostering a sense of unity among the people and", "abhorrence of Western style of governance.", "civil disobedience and killings of White officials.", "dismantling of artificial borders.", "political consciousness.", "D"],
  ["The Crown Colony policy introduced some progressive institutions of governance in West Africa such as the", "creation of the rigid class system.", "education of the traditional rulers.", "introduction of Western Legal system.", "introduction of military academy.", "C"],
  ["The following influential nationalist leaders contributed significantly to shaping the political destiny and nation-states of West Africa except", "Dawda Kairaba Jawara.", "Kwame Nkrumah.", "Nnamdi Azikiwe.", "Oliver Tambo.", "D"],
  ["Diplomacy plays a vital role in shaping the interactions between states and by extension maintaining", "bipolar world.", "global stability.", "power blocks.", "unipolar world.", "B"],
  ["Military rule does not only pose a threat to democracy but also to", "fundamental human rights.", "national borders.", "nationalism and patriotism.", "state sovereignty.", "A"],
  ["The following constitute the key features of most independent constitutions of West African States except", "nationalist leaders became army commanders.", "democratic principles of governance.", "national unity and diversity.", "socio-economic rights and development.", "A"],
  ["The grave effect of the French Colonial Policy of Assimilation in her West African Colonies was the", "aggressive development of nationalism.", "shortfall in the essential needs of the colonies.", "slow pace in their political fortunes.", "waging war on neighbouring colonial territories.", "C"],
  ["The British Colonial policy in her West African territories was marked by the following strategies and structures except", "divide and rule.", "economic exploitation.", "indirect rule.", "investments in the colonies.", "D"],
  ["Globalization impacts the development and progress of West African States by way of", "manipulation of economies of states.", "propping of regimes.", "protecting state sovereignty.", "technology transfer.", "D"],
  ["Power, authority, legitimacy and sovereignty are described in the study of government as what?", "Basic concepts and Principles", "Constitutionalism and meanings", "Principles and Structures", "Structure of Governance", "A"],
  ["A government with corrupt rulers who use their power to exploit the people and natural resources of their own territory to extend their personal wealth and political power is described as", "autocracy.", "capitalism.", "kleptocracy.", "oligarchy.", "C"],
  ["In what way can the local government system assist in national development? By", "aligning local efforts with broader national goals.", "depending on the central government for basic needs and development.", "encouraging youth movement to the industrial centres.", "ensuring only top-bottom policies of government are supported.", "A"],
  ["The perceived perennial problem of the United Nations (UN) since its inception is the", "Directive Principles of State Policy.", "deep seated diversity among member states.", "nature of political leaders and their ages.", "poor constitutional provisions of member states.", "B"],
  ["For the executive to enjoy the good will of the people in a democratic state, it must adhere to the tenets of", "the Council of State.", "exercise of unrestrained power.", "laissez-faire government.", "political equality.", "D"]
]
