[
  ["The average distance moved by a molecule between collisions is called", "molecular distance.", "intermolecular distance.", "mean distance.", "mean free path.", "D"],
  ["Which of the following waves requires a material medium for its propagation?", "Radio waves", "Light waves", "Sound waves", "X-rays", "C"],
  ["The depolarizing agent in a Leclanché cell is", "carbon rod.", "ammonium chloride.", "manganese (IV) oxide.", "zinc plate.", "C"],
  ["The material used to slow down the neutrons in a nuclear reactor is", "boron.", "copper.", "graphite.", "uranium.", "C"],
  ["Which of the following statements explains why hot soapy water is more effective in cleaning oil-stained dishes?", "The oil on the dishes repels the soap.", "Soap and heat decrease the surface tension of water.", "Hot water increases the surface tension of oil.", "Soap increases the surface tension of oil and water.", "B"],
  ["An electrical device has 50 turns in its primary coil and 20 turns in the secondary coil. The device can be a/an", "step-up transformer.", "step-down transformer.", "d.c. generator.", "a.c. generator.", "B"],
  ["The earpiece of a telephone handset converts energy from", "electrical to sound.", "sound to electrical.", "radio wave to sound.", "sound to radio wave.", "A"],
  ["A ray of light travelling from glass into ethyl alcohol is incident at the boundary at an angle of incidence 30°. Calculate the angle of refraction. [Refractive index of glass = 1.5; refractive index of ethyl alcohol = 1.36]", "27.0°", "33.5°", "51.5°", "72.8°", "B"],
  ["A 60 kg man stands on a weighing balance in an elevator. If the elevator accelerates upwards at 5 m/s², determine the reading of the scale. [g = 10 m/s²]", "300 N", "600 N", "800 N", "900 N", "D"],
  ["The length of an iron bar is 100 cm at 20 °C. At what temperature will its length increase by 0.01%? [Linear expansivity of iron = 1.2 × 10⁻⁵ °C⁻¹]", "48.0 °C", "38.0 °C", "28.3 °C", "23.0 °C", "C"],
  ["A moving-coil galvanometer which gives a full-scale deflection with 0.005 A is converted to a voltmeter, reading up to 5 V using an external resistance of 975 Ω. What is the resistance of the meter?", "0.25 Ω", "2.50 Ω", "25.00 Ω", "250.00 Ω", "C"],
  ["A beam consisting of α-particles, β-particles and γ-rays pass through a magnetic field at right angles to the direction of the field. Which of the following observations would be made about the α-particles, β-particles and γ-rays respectively?", "Deflected, deflected, deflected", "Deflected, deflected, not deflected", "Deflected, not deflected, deflected", "Not deflected, deflected, deflected", "B"],
  ["A parallel plate capacitor is charged and the charging battery subsequently disconnected. If the plates of the capacitor are moved farther apart by means of insulating handles, the", "capacitance would increase.", "capacitance would decrease.", "charge on the capacitor would increase.", "charge on the capacitor would decrease.", "B"],
  ["The velocity of sound in air at 15 °C is 340 m/s. Calculate the velocity at 47 °C.", "790 m/s", "602 m/s", "358 m/s", "322 m/s", "C"],
  ["In a collision between two objects, kinetic energy is conserved only if", "one of the objects was initially at rest.", "potential energy is converted to work.", "the collision is inelastic.", "the collision is elastic.", "D"],
  ["The quantity of motion of a body is its", "acceleration.", "displacement.", "momentum.", "velocity.", "C"],
  ["The volume of a fixed mass of a gas varies inversely as the pressure on it, provided the temperature is constant. This statement is", "Pressure law.", "Charles' law.", "Boyle's law.", "General gas law.", "C"],
  ["An image formed on a screen is always", "inverted.", "magnified.", "upright.", "virtual.", "A"],
  ["How would the capacitance of a parallel plate capacitor be affected if the distance of separation of its plates is decreased? It will", "increase in value.", "decrease slightly.", "remain unchanged.", "drop to zero.", "A"],
  ["Which of the following machines does not apply the lever principle?", "Claw hammer", "Wheelbarrow", "Single pulley", "Sugar tong", "C"],
  ["A 500 N box rests on a horizontal floor. A constant horizontal force is exerted on the box so that it moves through 8 m. If the coefficient of kinetic friction between the floor and the box is 0.22, calculate the work done on the box.", "880 J", "440 J", "400 J", "110 J", "A"],
  ["What factors determine the frequency of a note emitted by a vibrating string?", "Amplitude of vibration, force constant of string and length of string", "Amplitude of vibration, force constant of string and tension in string", "Mass per unit length of string, tension in string and length of string", "Force constant of string, tension in string and length of string", "C"],
  ["The magnitude of the force experienced by a charge of 1.6 × 10⁻⁸ C in a uniform electric field of intensity 5 × 10⁵ N C⁻¹ is", "3.2 × 10⁻¹⁴ N", "8.0 × 10⁻³ N", "8.0 × 10⁻⁵ N", "3.1 × 10¹³ N", "B"],
  ["Which of the following statements about viscosity is not true?", "depends on areas of the surfaces in contact.", "occurs in fluids.", "is independent of the relative velocity of the layers.", "depends on the tangential force between the layers.", "C"],
  ["A motorcycle starting from rest is uniformly accelerated such that its velocity in 10 s is 72 km hr⁻¹. What is its acceleration?", "108 m/s²", "86 m/s²", "4 m/s²", "2 m/s²", "C"],
  ["The temperature of an object is raised by 120 °C. The resulting increase in its absolute temperature is", "50 K", "120 K", "200 K", "393 K", "B"],
  ["Which of the following statements about the motion of a simple pendulum is true?", "It is a simple harmonic motion when the angle of displacement is large.", "It passes the equilibrium position with minimum speed.", "It possesses maximum kinetic energy at the extreme positions.", "It swings faster at the poles than at the equator.", "D"],
  ["An electron of mass m and charge e moves in a circular path in a magnetic field of flux density B. How long does it take to complete one orbit?", "2me / Bq", "2B / meq", "2πm / Be", "Be / 2πm", "C"],
  ["Which of the following statements about photoelectrons is correct?", "A faint green light produces photoelectrons with less kinetic energy than a bright red light.", "A red light releases a smaller number of electrons than a green light.", "A faint green light produces photoelectrons with greater kinetic energy than a bright red light.", "A red light produces more photoelectrons than a green light.", "C"],
  ["In the hydraulic press, the force F applied is related to the diameter d of the cylinder by", "F ∝ d²", "F ∝ d", "F ∝ d⁻¹", "F ∝ d⁻²", "A"],
  ["In an electric circuit, an inductor of inductance 0.5 H and resistance 50 Ω is connected to an alternating current source of frequency 60 Hz. Calculate the impedance of the circuit.", "50.0 Ω", "150.5 Ω", "195.0 Ω", "1950.1 Ω", "C"],
  ["Which of the following statements correctly explains why a total solar eclipse would be seen by people on only a small portion of the earth's surface?", "The moon is larger in diameter than the earth.", "The earth is larger in diameter than the sun.", "The earth revolves around the sun.", "The earth is larger in diameter than the moon.", "D"],
  ["Water waves have a wavelength of 3.6 cm and speed of 18 cm/s in deep water. If the waves enter shallow water with wavelength of 2.0 cm, calculate the speed of the waves in shallow water.", "0.4 cm/s", "2.5 cm/s", "10.0 cm/s", "10.8 cm/s", "C"],
  ["An a.c. generator can be converted to a d.c. electric motor by replacing the", "slip rings with a split ring and connecting a battery.", "split ring with slip rings and connecting a battery.", "a.c. with d.c. source and connecting slip rings.", "a.c. with d.c. source and connecting split rings.", "A"],
  ["A ray of light travels obliquely from a less dense medium to a denser medium. Which of the following statements is true about the light?", "The wavelength of the light increases in the second medium.", "The speed of the light increases in the second medium.", "The light refracts towards the normal.", "There is a change in the frequency of the light.", "C"],
  ["An electron of mass 9.1 × 10⁻³¹ kg is travelling at a speed of 2.0 × 10⁶ m s⁻¹. Calculate the associated wavelength of the electron. [h = 6.6 × 10⁻³⁴ Js]", "3.63 × 10⁻¹⁰ m", "3.63 × 10⁻⁸ m", "3.63 × 10⁻¹² m", "6.89 × 10⁻⁴ m", "A"],
  ["Which of the following statements about the process of melting of a solid are true? The temperature of the solid will I. decrease as melting starts. II. keep rising until melting starts. III. remain steady as melting proceeds. IV. keep rising as melting proceeds.", "I and III only", "III and IV only", "I, II and III only", "II, III and IV only", "D"],
  ["A diver steps off a diving platform that is 10 m above the water. If there is no air resistance during the fall, there will be a decrease in the diver's", "gravitational potential energy.", "total mechanical energy.", "kinetic energy.", "momentum.", "A"],
  ["Which of the following actions would increase the electric force between two positively charged particles?", "Decreasing the mass of the particles.", "Decreasing the distance between the particles.", "Increasing the distance between the particles.", "Increasing the mass of the particles.", "B"],
  ["A luminous object is one that", "gives off dim blue-green light only in the dark.", "gives out light of its own.", "shines by reflected light only.", "glows only in the presence of light.", "B"],
  ["Which of the following units is not fundamental?", "Metre", "Kilogram", "Joule", "Candela", "C"],
  ["The vacuum between the double walls of a thermos flask reduces heat loss through", "conduction and radiation.", "convection and conduction.", "radiation only.", "conduction only.", "B"],
  ["In photoelectric effect, the number of electrons emitted per second from a metallic surface is proportional to the", "intensity of the incident radiation.", "frequency of the incident radiation.", "energy of the incident radiation.", "work function of the metal.", "A"],
  ["Which of the following devices converts electrical energy to mechanical energy?", "Electric motor", "Electric heater", "Electric generator", "Electric bell", "A"],
  ["A non-uniform beam of weight W is balanced on two points A and B as illustrated in the diagram below. Which of the following equations are correct? I. Wb = R₁(a + b) II. Wₐ = R₂b III. Wb = R₁a IV. Wₐ = R₂(a + b)", "I and II only", "I and IV only", "II and IV only", "III and IV only", "C"],
  ["Which of the following features of the camera performs the same function as the iris of the human eye?", "Diaphragm", "Film", "Lens", "Shutter", "A"],
  ["Which of the following materials is used to shield radioactive fallout?", "Wood", "Plastic", "Lead", "Aluminium", "C"],
  ["Which of the following statements about radiant energy is correct?", "Radiant heat warms up the medium of transmission.", "Poor emitters of radiant heat are good absorbers.", "Good emitters of radiant heat are bad absorbers.", "Good absorbers of radiant heat are good emitters.", "D"],
  ["If the temperature of a given length of a semiconductor material is raised by half its original value, the resistance would", "decrease.", "fluctuate.", "increase.", "not change.", "A"],
  ["Which of the following waves is not a transverse wave?", "Waves produced from an object dropped in a pool of water", "X-rays", "Light waves", "Sound waves", "D"]
]
