[
  ["An automatic system is one that", "is operated using sophisticated skills", "needs fuel before it can be operated by humans", "performs different kinds of tasks diligently", "requires little or no human intervention to work", "D"],
  ["Which of the following features of information is not important for meaningful decision?", "Accuracy", "Competitiveness", "Completeness", "Timeliness", "B"],
  ["The microprocessor that controls a washing machine is known as", "bot", "console", "embedded computer", "mainframe computer", "C"],
  ["Which of the following statements is true about data?", "Information is a product of data while knowledge is a product of information", "Data produces knowledge while knowledge produces information", "Data is a product of information while knowledge is a product of data", "Knowledge produces information while information produces data", "A"],
  ["Instructions were written to the first generation computers using:", "assemblers", "low level language", "machine language", "mnemonics", "C"],
  ["Addition and subtraction of numbers in Abacus are done using", "nails", "brass", "beads", "frame", "C"],
  ["In using the slide rule, multiplication that goes off the scale can be corrected by the following approaches except", "resetting the slide", "using circular slide rule", "using flat scales", "using folded scales", "C"],
  ["The computer's short-term memory is the", "arithmetic logic unit", "arithmetic operator", "control unit", "random access memory", "D"],
  ["Which of the following logic devices is considered as equivalent gate?", "AND", "EX-NOR", "EX-OR", "NOR", "B"],
  ["MS Access is an example of", "word processing package.", "spreadsheet application.", "graphic software.", "database management system.", "D"],
  ["Which of the following statements explains the function of device drivers? They", "convert source code to object code.", "enable hardware and software control and manage the system.", "help to clean disk space and manage installation of applications.", "help to improve the functionality of hardware devices.", "D"],
  ["One usefulness of utility software in the computer is", "conversion of source code to object code.", "enhancement of communication between hardware and the computer system.", "removal of malware from the computer.", "to improve the functionality of hardware devices.", "C"],
  ["Which of the following statements about operating system is false? It", "enhances the booting process.", "manages computer devices.", "manages storage location.", "protects the computer from surge.", "D"],
  ["Debugging in program development is the process of", "fixing errors.", "introducing bugs.", "removing virus.", "writing error messages.", "A"],
  ["Identify the flowchart symbol in Figure 1.", "Decision box", "Manual input", "Preparation", "Process", "A"],
  ["The flowchart symbol in Figure 4 is used to", "show the preparation stage.", "represent a decision-making point.", "input data manually in a flowchart.", "execute a process.", "B"],
  ["Which of the following operations will be executed last in a program?", "Addition", "Division", "Multiplication", "Subtraction", "D"],
  ["Which of the following statements is true about the rules of flowcharting?", "All boxes of flowcharts are connected with arrows to show the logical connection between them", "All flowchart process boxes are connected with on page connector to show the flow of operation", "All flowcharts start with a start box and end with a decision box", "The flow of control must always enter an object from bottom to top", "A"],
  ["In computer programming, it is advised to translate source code into intermediate code to", "change the analysis portion for different compilers.", "ensure that full native compiler is used for every new machine that will run the program.", "make it easier to apply the source code modifications to improve code performance.", "make the synthesis part of the compiler target-machine dependent.", "C"],
  ["A graphic or text in a document or web page that links to another file or object is referred to as", "a domain name.", "a hyperlink.", "a shortcut.", "an icon.", "B"],
  ["Which of the following statements is true about preventing phishing?", "Ensure that antivirus is updated regularly", "Do not click on links in emails from untrusted sources", "Do not download from untrusted sites", "Use a strong password at all times.", "B"],
  ["Which of the following statements is true about star topologies?", "Computers are connected node-to-node", "Computers are connected to a central device", "The connection is linear in shape", "The connection is a tree-like structure", "B"],
  ["An internet user secures his social media account by regularly changing passwords. Which of the following passwords produce the best security?", "wasscec2024", "WASSCESC2024", "2024wasscec", "WASSCESchoolCandidates@2024", "D"],
  ["Which of the following statements is true about intranet?", "Private network that uses internet protocol and is accessible by all visitors to an organization's website", "Private network that uses internet protocol and is accessible by employees of an organization", "Private network which does not use internet protocol and is accessible by employees of an organization", "Public network that uses internet protocol and is accessible by all visitors to an organization's website", "B"],
  ["The art of checking for errors in a Word document before publishing is referred to as", "editing;", "formatting;", "modifying;", "proof reading.", "D"],
  ["Columns in MS Access are referred to as", "fields;", "files;", "records;", "tuples.", "A"],
  ["Which of the following application packages is suitable for making budgets?", "Word processor", "Spreadsheet package", "Graphic package", "Database Management System", "B"],
  ["New comment can be added to a cell in MS Excel by using the procedure", "Edit → Comment;", "File → Comment;", "Insert → Comment;", "Review → Comment.", "D"],
  ["Which of the following statements about index is true? It is a data structure", "that reduces the speed of data retrieval operations on a database table;", "used to quickly locate data without searching every row in a table every time a database table is accessed;", "created using only two rows of a database table to uniquely identify each record;", "that allows relational database to split and store data in different tables, while linking disparate items.", "B"],
  ["A collection of computer wires used to identify memory location in a computer is", "system bus;", "data bus;", "data cable;", "address bus.", "D"],
  ["Read Only Memory (ROM) contains", "current program in operation.", "preset instructions for operation;", "user instructions;", "volatile programs.", "B"],
  ["What happens when the Shift key is pressed down while deleting a file from the computer? The file is", "uninstalled from the computer.", "permanently deleted from the computer.", "deleted and sent to the Recycle Bin.", "deleted and kept in the clipboard.", "B"],
  ["Which of the following statements about warm booting is true? The computer", "reloads the operating system while still running in the background.", "loads the operating system into memory from the power-on button.", "reloads the operating system into memory while still running.", "loads the application into memory from rest state.", "C"],
  ["The ASCII character set represents alphabetical and control characters using numeric code ranging from", "0 to 32.", "0 to 64.", "0 to 127.", "0 to 128.", "C"],
  ["Which of the following hard disk drive memory capacities can store the largest size data?", "2TB.", "12GB.", "240MB.", "800KB.", "A"],
  ["The equivalent of the letter A in the standard ASCII is", "01000001.", "01000010.", "01100001.", "01100010.", "A"],
  ["One example of a file containing reference data which is usually altered is", "brand name.", "payroll.", "price list.", "stock.", "C"],
  ["A user observed that a certain file in a removable storage device changed to a shortcut icon. This implies that", "the file is corrupt.", "the file is shared.", "the removable storage device is corrupt.", "there is a link to the file.", "D"],
  ["Set of characters used to authenticate a computer user is called", "encoder.", "binary code.", "password.", "barcode.", "C"],
  ["Which of the following statements about firewall is correct?", "A network transmission system that increases the speed of incoming and outgoing network traffic.", "A network security system that establishes a barrier between a trusted internal network and an untrusted external network such as the Internet.", "A data structure that improves the speed of data retrieval operations on a database table.", "A data structure created using only two rows of a database table used to uniquely identify each record.", "B"],
  ["250H is a/an ______ data type.", "Special character", "Numeric", "Alphabetic", "Alphanumeric", "D"],
  ["An automated machine which dispenses snacks and beverages to consumers after the insertion of a credit card is a/an ______.", "vending.", "point of sale.", "label dispensary.", "inventory.", "A"],
  ["Which of the following softwares act as an interface between the end user and the computer hardware?", "Windows XP", "Ms Word", "Ms Excel", "Ms Access", "A"],
  ["Which of the following is not a source of threat to a computer system?", "Virus", "Prudent network implementation", "Lack of ICT policy", "Hackers", "B"],
  ["Which of the following cable media does not suffer from electromagnetic interference?", "USB", "Unshielded twisted pair", "Serial", "Fibre optic", "D"],
  ["The result of the BASIC program below is 10 FOR I = 1 TO 49 STEP 2 20 PRINT I 30 NEXT I 40 END", "sum of the cubes of odd integers between 1 and 49,", "squares of even integers between 1 and 49,", "odd numbers between 1 and 49 inclusive,", "odd numbers between 1 and 49 exclusive,", "C"],
  ["The removal of unwanted portions of a picture in a document could be achieved through", "referencing.", "formatting.", "enlarging.", "cropping.", "D"],
  ["A physical connection between the microprocessor memory and other parts of the micro computer is", "registers.", "program contact.", "path.", "address bus.", "D"],
  ["In computer, instructions and memory addresses are represented by", "binary code..", "nibble.", "character code.", "byte.", "A"],
  ["A collection of interrelated records is a", "structure", "database", "file", "field", "B"]
]
